#lang sicp

(#%require rackunit)

; TASK:
;Треугольник Паскаля
;Приведенная ниже таблица называется треугольником Паскаля (Pascal’s triangle).
;
;     1
;    1 1
;   1 2 1
;  1 3 3 1
; 1 4 6 4 1
;    ...
;
;  Все числа по краям треугольника равны 1, а каждое число внутри
;  треугольника равно сумме двух чисел над ним. Напишите процедуру,
;  вычисляющую элементы треугольника Паскаля с помощью рекурсивного
;  процесса.
;


; SOLUTION:
#| (define (pascal-triangle level) |#

#|   ) |#


; TESTS:

#| (check-equal? (f 5) 25) |#
#| (check-equal? (f-iter 4) 11) |#
#| (check-equal? (f 3) 4) |#
#| (check-equal? (f-iter 1) 1) |#
